app/controllers/user_sessions_controller.rb

  def create

    omniauth = env['omniauth.auth']
    logger.debug "+++ #{omniauth}"

    user = User.find_by_uid(omniauth['uid'])
    if not user
      # New user registration
      user = User.new(:uid => omniauth['uid'])
    end
    user.first_name = omniauth['extra']['first_name']
    user.last_name  = omniauth['extra']['last_name']
    user.save
---
SELECT "users".* FROM "users" WHERE "users"."uid" = '1' LIMIT 1
INSERT INTO "users" ("created_at", "first_name", "last_name", "status", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Thu, 05 Mar 2015 11:49:05 UTC +00:00], ["first_name", nil], ["last_name", nil], ["status", nil], ["uid", "1"], ["updated_at", Thu, 05 Mar 2015 11:49:05 UTC +00:00]]
UPDATE "users" SET "first_name" = 'keith', "updated_at" = '2015-02-02 12:06:34.323735' WHERE "users"."id" = 2